const util = require('util');
const fs = require('fs-extra');
const { zokou } = require(__dirname + "/../framework/zokou");
const { format } = require(__dirname + "/../framework/mesfonctions");
const os = require("os");
const moment = require("moment-timezone");
const s = require(__dirname + "/../set");
const more = String.fromCharCode(8206)
const readmore = more.repeat(4001)

zokou({ nomCom: "menu", categorie: "menu" }, async (dest, zk, commandeOptions) => {
    let { ms, repondre ,prefixe,nomAuteurMessage,mybotpic} = commandeOptions;
    let { cm } = require(__dirname + "/../framework//zokou");
    var coms = {};
    var mode = "public";
    
    if ((s.MODE).toLocaleLowerCase() != "yes") {
        mode = "private";
    }


    

    cm.map(async (com, index) => {
        if (!coms[com.categorie])
            coms[com.categorie] = [];
        coms[com.categorie].push(com.nomCom);
    });

    moment.tz.setDefault('Etc/GMT');

// Créer une date et une heure en GMT
const temps = moment().format('HH:mm:ss');
const date = moment().format('DD/MM/YYYY');

  let infoMsg =  `
  ╭──━━═━━━━━╮
  ┃💬 *ʙᴏᴛ ɴᴀᴍᴇ* : ɴᴊᴀʙᴜʟᴏ ᴊʙ
  ┃🧚 *ᴜsᴇ ɴᴀᴍᴇ* : ${nomAuteurMessage} 
  ┃🛸 *ᴘʀᴇғɪx* : [${s.PREFIXE}]
  ┃🔏 *ᴍᴏᴅᴇ* : ${mode}
  ┃🛸 *ᴘʟᴜɢɪɴ* : ${cm.length} 
  ┃🚀 *ʀᴏᴍ* : ${format(os.totalmem() - os.freemem())}/${format(os.totalmem())}
  ┃📟 *ʀᴜɴɴɪɴɢ ᴏɴ* : ${os.platform()}
  ┃📆 *ᴅᴀᴛᴇ* ${date}
  ┃⏱️ *ᴛɪᴍᴇ* : ${temps}
  ╰──━━═━━━━┈╯

  
 > *@🔏ɴᴊᴀʙᴜʟᴏ ᴊʙ ᴄᴏᴍᴍᴀɴᴅ💬*
  ╰═━┈➤${readmore}
 ‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎
  

📜 *oll Commands Njabulo*: 🗒️

📄 *ɪᴀ*
- .ʙᴏᴛ
- .ᴅᴀʟʟᴇ
- .ɢᴘᴛ
- .ɴᴊᴀʙᴜʟᴏ

📄 *ɢᴇɴᴇʀᴀʟ*
- .ᴏᴡɴᴇʀ
- .ᴅᴇᴠ
- .sᴜᴘᴘᴏʀᴛ
- .ᴅᴇᴠᴇʟᴏᴘᴇʀ
- .ᴀʟɪᴠᴇ
- .ᴀɴᴛɪ-ᴅᴇʟᴇᴛᴇ
- .ᴜʀʟ
- .ᴅᴇᴘʟᴏʏ
- .ᴘɪɴɢ
- .ᴘɪɴɢ1
- .ɢᴇᴛᴀʟʟ
- .ᴅᴇᴘʟᴏʏᴇʀ
- .ᴘᴏʟʟ
- .ʀᴇᴘᴏ
- .ɢɪᴛ
- .ᴛᴇsᴛ
- .ᴜᴘᴛɪᴍᴇ
- .ss
- .ᴘʟᴀʏ1
- .ʜᴀᴄᴋ
- .ᴍᴇɴᴜ
- .ᴍᴇɴᴜ-ʟɪsᴛ 

📃 *ɢʀᴏᴜᴘ*
- .ᴋɪᴄᴋᴀʟʟ
- .ᴏɴʟʏᴀᴅᴍɪɴ
- .ғᴏʀᴡᴀʀᴅ
- .ᴡᴇʟᴄᴏᴍᴇ
- .ɢᴏᴏᴅʙʏᴇ
- .ᴀɴᴛɪᴘʀᴏᴍᴏᴛᴇ
- .ᴀɴᴛɪᴅᴇᴍᴏᴛᴇ
- .ᴀᴅᴅ
- .ᴀᴘᴘʀᴏᴠᴇ
- .ᴠᴄғ
- .ᴛᴀɢᴀʟʟ
- .ɪɴᴠɪᴛᴇ
- .ᴘʀᴏᴍᴏᴛᴇ
- .ᴅᴇᴍᴏᴛᴇ
- .ʀᴇᴍᴏᴠᴇ
- .ɪɴғᴏ
- .ᴀɴᴛɪʟɪɴᴋ
- .ᴀɴᴛɪʙᴏᴛ
- .ɢʀᴏᴜᴘ
- .ʀᴇᴠᴏᴋᴇ
- .ʜɪᴅᴇᴛᴀɢ
- .ᴀᴜᴛᴏᴍᴜᴛᴇ
- .ᴀᴜᴛᴏᴜɴᴍᴜᴛᴇ
- .ғᴋɪᴄᴋ
- .ᴀɴᴛɪᴡᴏʀᴅ
- .ᴀɴᴛɪʟɪɴᴋ-ᴀʟʟ
- .ᴛᴀɢᴀᴅᴍɪɴ
- .ᴡᴀʀɴ

📄 *ᴍᴏᴅs*
- .ᴛɢs
- .ᴄʀᴇᴡ
- .ʟᴇғᴛ
- .ᴊᴏɪɴ
- .ᴊɪᴅ
- .ʙʟᴏᴄᴋ
- .ᴜɴʙʟᴏᴄᴋ
- .ʙᴀɴ
- .sᴜᴅᴏ
- .sᴀᴠᴇ
- .ᴍᴇɴᴛɪᴏɴ
- .ʙᴏᴏᴍ

📃 *ғᴜɴ*
- .ʜᴀᴄᴋ
- .ғᴀɴᴄʏ
- .ᴘʀᴏғɪʟᴇ
- .ǫᴜᴏᴛᴇ
- .ʀᴀɴᴋ

🗒️ *sᴇᴀʀᴄʜ*
- .ɢᴏᴏɢʟᴇ
- .ᴍᴏᴠɪᴇ
- .ᴡᴇᴀᴛʜᴇʀ
- .ɪᴍɢ
- .ᴠɪᴅᴇᴏᴅᴏᴄ
- .ᴅᴇғɪɴᴇ
- .ʟʏʀɪᴄs
- .sᴛɪᴄᴋᴇʀsᴇᴀʀᴄʜ
- .ᴠɪᴅᴇᴏ

🗒️ *ᴄᴏɴᴠᴇʀsɪᴏɴ*
- .ᴇᴍᴏᴍɪx
- .sᴛɪᴄᴋᴇʀ
- .ᴛᴀᴋᴇ
- .ᴡʀɪᴛᴇ
- .ᴘʜᴏᴛᴏ
- .ᴛʀᴛ

📃 *ᴅᴏᴡɴʟᴏᴀᴅ*
- .ᴀᴘᴋ
- .ғʙ
- .ᴛɪᴋᴛᴏᴋ
- .ғʙ2
- .ᴘʟᴀʏ2
- .sᴏɴɢ2
- .ᴠɪᴅᴇᴏ 
- .ᴍᴏᴠɪᴇ
- .ᴘʟᴀʏ
- .sᴏɴɢ
- .ᴠɪᴅᴇᴏ2 

📜 *ᴀᴜᴅɪᴏ-ᴇᴅɪᴛ*
- .ᴅᴇᴇᴘ
- .ʙᴀss
- .ʀᴇᴠᴇʀsᴇ
- .sʟᴏᴡ
- .sᴍᴏᴏᴛʜ
- .ᴛᴇᴍᴘᴏ 

📃 *ɢᴏᴅ-ғɪʀsᴛ*
- .ʙɪʙʟᴇ

🗒️*ᴍᴇɴᴜ*
- .ʙᴜɢᴍᴇɴᴜ
- .ʜᴇʟᴘ
- .ᴍᴇɴᴜ-ʟɪsᴛ 

📄 *ɪᴍᴀɢᴇ-ᴇᴅɪᴛ*
- .sʜɪᴛ
- .ᴡᴀsᴛᴇᴅ
- .ᴡᴀɴᴛᴇᴅ
- .ᴛʀɪɢɢᴇʀ
- .ᴛʀᴀsʜ
- .ʀɪᴘ
- .sᴇᴘɪᴀ
- .ʀᴀɪɴʙᴏᴡ
- .ʜɪᴛʟᴇʀ
- .ɪɴᴠᴇʀᴛ
- .ᴊᴀɪʟ
- .ᴀғғᴇᴄᴛ
- .ʙᴇᴀᴜᴛɪғᴜʟ
- .ʙʟᴜʀ
- .ᴄɪʀᴄʟᴇ
- .ғᴀᴄᴇᴘᴀʟᴍ
- .ɢʀᴇʏsᴄᴀʟᴇ
- .ᴊᴏᴋᴇ

📜 *ᴜsᴇʀ*
- .ᴄᴏᴅᴇ
- .ᴅᴇʟ
- .ɢʀᴏᴜᴘs
- .ғᴀᴄᴛ
- .ǫᴜᴏᴛᴇs
- .ᴡʜᴏɪs
- .ɢᴇᴛᴘᴘ

📃 *ɴᴊᴀʙᴜʟᴏ-ᴘɪᴄs*
- .ᴅᴇsɪɢɴ

🗒️ *ɢᴀᴍᴇs*
- .ʀɪᴅᴅʟᴇ
- .ᴄʜɪғᴜᴍɪ
- .ǫᴜɪᴢᴢ

📄 *ɴᴊᴀʙᴜʟᴏ-ᴛᴇsᴛ*
- .ᴀɴᴛɪᴄᴀʟʟ
- .ᴀʀᴇᴀᴄᴛ
- .ʀᴇᴀᴅsᴛᴀᴛᴜs
- .ᴀɴᴛɪᴅᴇʟᴇᴛᴇ
- .ᴅᴏᴡɴʟᴏᴀᴅsᴛᴀᴛᴜs
- .sᴛᴀʀᴛᴍᴇssᴀɢᴇ
- .ʀᴇᴀᴅᴍᴇssᴀɢᴇ
- .ᴀᴜᴛᴏᴛʏᴘɪɴɢ
- .ᴀʟᴡᴀʏsᴏɴʟɪɴᴇ

📃 *ʜᴇɴᴛᴀɪ*
- .ʜᴡᴀɪғᴜ
- .ᴛʀᴀᴘ
- .ʜɴᴇᴋᴏ
- .ʙʟᴏᴡᴊᴏʙ
- .ʜᴇɴᴛᴀɪᴠɪᴅ
- .ᴀss
- .ᴍᴀsᴛᴇʀʙᴀᴛɪᴏɴ
- .ᴛʜɪɢʜ
- .ᴘᴀɴᴛʏ

🗒️ *ᴍᴏᴅᴇʀɴ-ʟᴏɢᴏ*
- .ʙɪʀᴛʜᴅᴀʏ
- .ᴄᴏᴍɪᴄ
- .ᴢᴏᴅɪᴀᴄ
- .ᴡᴀᴛᴇʀ2
- .ɢʟᴏᴡ
- .ʙᴏᴋᴇʜ
- .ғɪʀᴇᴡᴏʀᴋ
- .ɢᴀᴍɪɴɢ
- .sɪɢɴᴀᴛᴜʀᴇ
- .ʟᴜxᴜʀʏ
- .ᴅʀᴀɢᴏɴғɪʀᴇ
- .ғᴏɢɢʏ
- .sᴜᴍᴍᴇʀ
- .ʟɪɢʜᴛ
- .ɢᴀʟᴀxʏ
- .ʜᴀᴄᴋᴇʀ
- .ᴅʀᴀɢᴏɴʙᴀʟʟ
- .ɴᴀʀᴜᴛᴏ
- .ᴅɪᴅᴏɴɢ
- .ᴘᴜʀᴘʟᴇ
- .ɢᴏʟᴅ
- .ᴀʀᴇɴᴀ
- .ɪɴᴄᴀɴᴅᴇsᴄᴇɴᴛ
- .ᴄʜʀɪsᴛᴍᴀs
- .ғʀᴏsᴛ
- .ᴄʜʀɪsᴛᴍᴀs
📄 *ʀᴇᴀᴄᴛɪᴏɴ*
- .ʙᴜʟʟʏ
- .ᴄᴜᴅᴅʟᴇ
- .ᴄʀʏ
- .ʜᴜɢ
- .ᴀᴡᴏᴏ
- .ᴋɪss
- .ʟɪᴄᴋ
- .ᴘᴀᴛ
- .sᴍᴜɢ
- .ʙᴏɴᴋ
- .ʏᴇᴇᴛ
- .ʙʟᴜsʜ
- .sᴍɪʟᴇ
- .ᴡᴀᴠᴇ
- .ʜɪɢʜғɪᴠᴇ
- .ʜᴀɴᴅʜᴏʟᴅ
- .ɴᴏᴍ
- .ʙɪᴛᴇ
- .ɢʟᴏᴍᴘ
- .sʟᴀᴘ
- .ᴋɪʟʟ
- .ᴋɪᴄᴋ
- .ʜᴀᴘᴘʏ
- .ᴡɪɴᴋ
- .ᴘᴏᴋᴇ
- .ᴅᴀɴᴄᴇ
- .ᴄʀɪɴɢᴇ

📄 *sᴛɪᴄᴋᴄᴍᴅ*
- .sᴇᴛ
- .ᴅᴇʟᴄᴍᴅ
- .ᴀʟʟᴄᴍᴅ
- .ᴅɪᴛ
- .ɪᴛᴛᴀ
- .sᴀʏ

📃 *ɢéɴéʀᴀʟ*
- .ᴠᴠ

🗒️ *ʙᴜɢ-ᴄᴍᴅs*
- .ʙᴜɢᴍᴇɴᴜ
- .ʙᴜɢ
- .ᴄʀᴀsʜ
- .ʟᴏᴄᴄʀᴀsʜ
- .ᴄʀᴀsʜʙᴜɢ

📄 *ᴀɴɪᴍᴇ*
- .ᴡᴀɪғᴜ
- .ɴᴇᴋᴏ
- .sʜɪɴᴏʙᴜ
- .ᴍᴇɢᴜᴍɪɴ
- .ᴄᴏsᴘʟᴀʏ
- .ᴄᴏᴜᴘʟᴇᴘᴘ`;
    
let menuMsg = `  
    
@ɴᴊᴀʙᴜʟᴏ ᴊʙ ᴏғғɪᴄᴇ 2025`;

   var lien = mybotpic();

   if (lien.match(/\.(mp4|gif)$/i)) {
    try {
        zk.sendMessage(dest, { video: { url: lien }, caption:infoMsg + menuMsg, footer: "Je suis *Njabulomd*, déveloper Njabulo Jb" , gifPlayback : true }, { quoted: ms });
    }
    catch (e) {
        console.log("🥵🥵 Menu erreur " + e);
        repondre("🥵🥵 Menu erreur " + e);
    }
} 
// Vérification pour .jpeg ou .png
else if (lien.match(/\.(jpeg|png|jpg)$/i)) {
    try {
        zk.sendMessage(dest, { image: { url: lien }, caption:infoMsg + menuMsg, footer: "Je suis *Njabulomd*, déveloper Njabulo MD" }, { quoted: ms });
    }
    catch (e) {
        console.log("🥵🥵 Menu erreur " + e);
        repondre("🥵🥵 Menu erreur " + e);
    }
} 
else {
    
    repondre(infoMsg + menuMsg);
    
}

});
